<!--  -->
<template>
  <div>
    <div class="title">《派图租赁专享小程序订购协议》</div>
    <div class="text-box">
      <p>
        欢迎订购派图租赁小程序服务（下称“小程序”），您订购的小程序服务是由珠海穿山甲科技有限责任公司（以下简称“派图租赁”）通过派图租赁平台相关功能向您提供的服务。在您使用小程序服务之前，您应当仔细阅读并遵守本《派图租赁小程序订购协议》（下称“本协议”），本协议由您与派图租赁之间共同签署，并具有合同效力，请您务必审慎阅读、充分理解并遵守本协议，一旦您点击确认本协议，即表示您已接受了以下所述的条款内容，同意受本协议约束。如果您不同意接受全部的条款，那么您将无法订购和使用小程序服务。本协议包括正文以及所有派图租赁已经发布或将来可能发布的相关规则，
        <b>特别是限制或免除责任的相应条款、争议解决和法律适用条款。限制或免除责任条款可能将以加粗字体形式显示，提示您注意，您应重点阅读。</b>
      </p>
      <p>派图租赁有权根据产品需要不定期地制定、修改本协议及/或各类规则，并在派图租赁平台内进行公示，不再另行单独通知您。如果您不同意修改后的协议或各类规则，您应立即停止使用本服务，继续使用本服务的视为您已经接受了修改后的协议内容。</p>
      <p>如果您违反本协议的任何约定，派图租赁有权依照本协议随时单方面限制、中止或终止向您提供本服务等措施，并有权追究您的相关经济及法律责任。</p>
      <h4>一、小程序订购方式</h4>
      <p>1、在您开通小程序功能之前，需满足以下条件：</p>
      <div class="long">
        <p>1.1 您需要成功注册成为派图租赁商家且需通过用户实名制的审核，方可订购小程序服务。</p>
        <p>
          1.2 您需要在腾讯旗下的微信公众平台
          <a
            href="https://mp.weixin.qq.com"
            style="color:blue"
          >https://mp.weixin.qq.com</a> 先开通微信小程序账号。
        </p>
        <p>
          <b>1.3 小程序只支持企业法人用户以及个体工商户使用，不支持个人用户订购。</b>
        </p>
      </div>
      <h4>二、服务提供方</h4>
      <p>1、您知悉，派图租赁经您的合法授权通过与微信小程序技术接口对接的方式，从而帮您实现派图租赁店铺小程序的提交审核、发布代码功能。一经您的合法授权，派图租赁将会获取您在微信小程序中提交的头像、名称以及简介信息，用于您的店铺小程序展示使用。</p>
      <h4>三、服务条款</h4>
      <p>1、您了解，基于小程序通过腾讯微信平台使用，除遵守本协议外，还应遵守腾讯平台相关协议或规则，包括但不限于《腾讯服务协议》、《腾讯微信软件许可及服务协议》、《微信公众平台服务协议》、《微信小程序平台服务条款》等。</p>
      <p>2、您店铺的经营类目、上架的商品以及相关资质材料的提交应符合微信小程序相关规则，如因您的店铺不符合微信小程序相关规则导致小程序功能未能实现的，与派图租赁无关，派图租赁不承担任何责任。</p>
      <p>
        3、您同意并授权，派图租赁在您使用小程序服务时收集并留存您的相关交易数据。
        <b>授权后派图租赁将按照服务协议，不定期更新小程序的内容，包含但不限于代码和域名配置等，更新后会覆盖前授权历史数据，您需要获悉，授权后默认您同意变更。</b> 如您在使用本服务时违反本协议或派图租赁平台其他规则，派图租赁有权采取相应措施，包括但不限于下架或删除商品、停止向您继续提供服务等，并且已缴纳的费用不予退还。
      </p>
      <p>4、您应确保您的店铺经营行为符合派图租赁平台以及腾讯平台发布的相关协议或规则，因您违反上述规定导致本服务无法使用的，已缴纳的费用将不予退还。如因使用本服务给派图租赁或第三方造成损失的，您应承担全部赔偿责任。</p>
      <h4>四、服务费用</h4>
      <p>1、派图租赁向首次开通小程序的用户免费提供7天试用期，试用期结束后如继续使用本服务，则需缴纳一定服务使用费用，具体金额以及对应的使用期限以产品页面相关提示为准。缴费成功后不支持退款。如您申请开票，请致电派图租赁官方客服电话0756-3444514，派图租赁会将需要提交的资料以短信形式下发至您的手机中。</p>
      <p>2、您成功完成缴费后，该功能即可使用。</p>
      <p>3、本服务开通后，如您单方面原因停止使用该项服务的，您缴纳的费用不支持退还。如因派图租赁单方原因停止向您提供该项服务的，派图租赁将根据您实际使用时间折算一定比例金额将剩余金额退还您。</p>
      <p>4、出现下列任意情形的，派图租赁有权单方终止本协议：</p>
      <div class="long">
        <p>4.1服务到期且到期后未续费购买的；</p>
        <p>4.2您的店铺违反本协议或派图租赁平台规则的；</p>
        <p>4.3您在派图租赁的剩余规则分等于0分；</p>
        <p>4.4您违反腾讯公司相关协议或规定的。</p>
      </div>
      <h4>五、免责声明及有限保证</h4>
      <p>
        <b>1、您理解并同意，您必须为自己注册帐号下的一切行为负责，包括您所传送的任何内容以及由此产生的任何后果。您应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。派图租赁无法且不会对因用户行为而导致的任何损失或损害承担责任。</b>
      </p>
      <p>
        <b>2、您理解并同意，本平台融合通信能力开放均基于运营商能力和资源，由于通信能力、系统、网络和资源的不确定性，派图租赁尽可能的维护能力的安全稳定，但对此不做任何保证；</b>
      </p>
      <p>
        <b>3、对于因不可抗力或派图租赁不能控制的原因造成的网络服务中断或其它缺陷，派图租赁不承担任何责任，但将尽力减少因此而给您造成的损失和影响。</b>
      </p>
      <p>
        <b>4、您理解并同意，因业务发展需要，派图租赁保留单方面对本服务的全部或部分服务内容变更、暂停、终止或撤销的权利，您需承担此风险。</b>
      </p>
      <p>
        <b>5. 派图租赁有权根据风险及自身业务运营情况需要，在您接受本服务的使用时，视为授权派图租赁单方面不经通知对小程序作出相应的修改及其他商家认为合理的处理。</b>
      </p>
      <p>
        <b>6.因用户使用本服务提交的相关数据，包括但不限于您在提交、操作中形成的数据及各类交易数据、您在使用微信小程序服务所形成的数据，在不损害您的合法权益的前提下，派图租赁有权进行收集、使用及修改等。</b>
      </p>
      <p>
        <b>7.您停用该服务或授权，或派图租赁终止向您提供本协议项下的服务后，派图租赁不再为您保留原账户中与之相关的任何信息；因此导致您无法使用服务或服务受到限制，派图租赁不构成违约，亦不承担任何法律责任。</b>
      </p>
      <h4>六、法律适用与争议解决</h4>
      <p>1、本协议之订立、生效、解释、变更、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如无相关法律规定的，则应参照通用国际商业惯例及/或行业惯例。</p>
      <p>2、因本协议产生的一切争议应由您与派图租赁协商解决。协商解决不成的，您同意由派图租赁所在地人民法院诉讼解决。</p>
    </div>
  </div>
</template>

<script>
export default {
  data: () => ({}),

  components: {},

  mounted() {},

  methods: {}
};
</script>
<style rel='stylesheet/scss' lang='scss' scoped>
.title {
  text-align: center;
  margin-bottom: 20px;
  font-weight: bold;
  font-size: 18px;
}
.text-box {
  text-indent: 40px;
  line-height: 35px;
  .long {
    text-indent: 60px;
  }
}
</style>