<template>
  <div class="wrap">
    <el-dialog
      title="派图租赁隐私保护条款"
      :visible.sync="dialogVisible"
      width="50%"
      :close-on-click-modal="false"
      :close-on-press-escape="false"
      :before-close="handleClose"
    >
      <h1>派图租赁隐私保护条款</h1>
      <p>
        珠海穿山甲科技有限责任公司（以下或称“我们”）注重保护用户个人信息及个人隐私。本隐私条款包含我们
        <span
          class="deep-black"
        >收集、处理、存储、使用、共享、转让、公开披露</span>和保护用户（“您”）个人信息（以下或称“信息”）的有关条款。
      </p>
      <p class="deep-black">本条款将帮助您了解以下内容：</p>
      <p class="deep-black">1. 信息采集授权；</p>
      <p class="deep-black">2. 信息使用授权；</p>
      <p class="deep-black">3. 信息共享授权；</p>
      <p class="deep-black">4. 信息的安全和保护措施；</p>
      <p class="deep-black">5. 风险提示；</p>
      <p class="deep-black">6. 通知和修订。</p>
      <p>
        我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
        <span
          class="deep-black"
        >请您在使用我们的服务前，仔细阅读并了解本《隐私保护条款》（以下简称“隐私条款”），以帮助您了解维护自己隐私权的方式。如您对本隐私条款有任何疑问，您可以通过公开的派图租赁客服联系方式与我们联系。</span>
      </p>
      <p>
        我们希望通过本隐私条款向您清晰地介绍我们对您个人信息的处理方式，因此我们建议您完整地阅读本条款，以帮助您了解维护自己隐私权的方式。如您对本隐私条款有任何疑问，您可以通过我们公布的联系方式与我们联系。
        <span
          class="deep-black"
        >如果您不同意本隐私条款的任何内容，您应立即停止使用我们服务。当您使用我们提供的任一服务时，即表示您已同意我们按照本隐私条款来收集、处理、存储、使用、共享和保护您的个人信息。</span>
      </p>
      <h2>一、适用范围</h2>
      <p>本隐私条款适用于派图租赁平台提供的所有服务（以下称“服务”或“我们的服务”），您访问和使用派图租赁平台、下载派图影像管理软件等，均适用本隐私条款。</p>
      <p>本隐私条款所称“派图租赁平台”包括但不限派图租赁平台 （域名为www.paitume.com）,派图影像管理软件等网站及软件，以及相关移动服务端或微信公众号平台等。</p>
      <p>本隐私条款所称“派图租赁”是珠海穿山甲科技有限责任公司的提供的相关服务或开发的相关软件。</p>
      <p>
        我们所有的服务均适用本隐私条款。此外，
        <span
          class="deep-black"
        >针对某些特定服务，我们还将制定特定隐私条款，以便更具体地说明我们在该特定服务中如何收集、处理、存储、使用、共享和保护您的信息。</span>该特定服务的隐私条款构成本隐私条款的一部分。
        <span class="deep-black">如相关特定服务的隐私条款与本隐私条款有不一致之处，适用该特定服务的隐私条款。</span>
      </p>
      <p>
        <span
          class="deep-black"
        >本隐私条款不适用于通过我们的服务而接入的其他第三方服务（“其他第三方”，包括但不限于您的交易相对方、任何第三方网站以及第三方服务提供者）收集的信息。我们对前述第三方使用您个人信息的行为及后果不承担任何责任。</span>请您注意，其他第三方可能有自己的隐私权保护条款；当您查看其他第三方创建的网页或使用其他第三方开发的应用程序时，可能会发现该网页或应用程序放置的Cookie或像素标签。这些Cookie或标签不受我们的控制，而且它们的使用不受本条款的约束。
      </p>
      <h2>二、信息采集授权</h2>
      <p>个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。</p>
      <p>
        我们仅会出于本条款所述的以下目的，收集和使用您的个人信息：为了遵守法律法规的要求，为了想您提供相关服务，并努力提高您的服务体验。
        <span
          class="deep-black"
        >您向我们提供下述信息或使用我们的服务时，即表示您同意并授权我们按照本条款规定收集信息，您同意承担由此带来的一切法律后果。</span>您授权我们采集的信息种类如下：
      </p>
      <p>
        <span class="deep-black">1. 您向我们提供的信息。</span>为了遵守法律法规的要求，以及向您提供更个性化、更便捷的服务，我们需要识别您的身份，当您注册我们的账户及您在使用我们的相关服务时，需要您填写、提交及/或以其他任何方式提供您的个人信息，包括但不限于您的姓名、性别、出生年月日、身份证号码、护照姓、护照名、护照号码、电话号码、电子邮箱、居住地址及相关附加信息（如您地址中的所在省份和城市、邮政编码等）、银行账户或其他支付工具的账户信息、账单信息（如您的信用卡号码、持卡人姓名及信用卡有效期等）、个人、车辆及行车信息等（如您的姓名、公司信息、车辆行驶证信息、驾驶证信息以及监督卡信息等）；
      </p>
      <p>
        <span class="deep-black">您可以选择不提供某一或某些信息，但是这样可能使我们无法全面判断您的相关情况，进而无法为您提供更准确、高效的服务。</span>请您理解，我们使用您提供的信息是为了回应您的要求，为您享受我们提供服务提供便利，完善我们的网站以及与您进行信息沟通。
      </p>
      <p>
        <span class="deep-black">2. 我们在您使用服务过程中获得的信息。</span>为达成您与平台商家的交易，履行租借服务，并提升派图租赁再次向您提供服务的用户体验，您授权派图租赁采集并留存您在购买相关服务或其他服务机构提供并形成的信息，包括但不限于姓名、身份证号、联系电话、联系地址等相关信息。
      </p>
      <h2>三、信息使用授权</h2>
      <p>您同意并不可撤销地授权派图租赁以为您提供更好的服务、用以评价您信用情况或核实您信息的真实性之目的，保存、整理、加工和披露前述第二条所述的、通过合法途径采集的您的信息，并基于以下用途使用您的前述第二条信息：</p>
      <p class="deep-black">（1）出于为您提供服务的需要，使用您的去标识化后您的个人信息改进派图租赁平台的设计和推广；</p>
      <p class="deep-black">（2）在不透露您及您提供数据的信息源的隐私资料的前提下，派图租赁对整个用户及用户提供的数据的数据库进行分析并对该数据库进行商业上的利用；</p>
      <p
        class="deep-black"
      >（3）根据法律规定及合理商业习惯，在我们计划与其他公司合并或被其收购或进行其他资本市场活动（包括但不限于IPO，债券发行）时，以及其他情形下我们需要接受来自其他主体的尽职调查时，我们会把您的信息提供给必要的主体，但我们会通过和这些主体签署保密协议等方式要求其对您的个人信息采取合理的保密措施。</p>
      <p class="deep-black">（4）其他您同意的用途。</p>
      <h2>四、信息共享授权</h2>
      <p>我们对您的个人信息承担保密义务，非经您授权，我们不会将您的信息提供给任何第三方机构或个人，同时您授权我们在下列情况中将您的信息与第三方共享：</p>
      <p
        class="deep-black"
      >（1）为了提升我们的产品及服务质量或向您提供全新的产品及服务，我们会在关联公司内部共享您的相关信息，也可能在必要的程度内将您的合理必要信息提供给第三方用于分析和统计；</p>
      <p
        class="deep-black"
      >（2）如果您通过派图租赁平台使用的某些产品及服务是由我们的合作伙伴提供的，或是由我们与合作伙伴或供应商共同提供的，我们将与其共享向您提供相应产品及服务所必需的信息；</p>
      <p
        class="deep-black"
      >（3）在您违反与我们或我们的其他用户签订的协议时，您的违约信息将被提交至第三方征信机构及/或第三方信息服务公司，记录在该第三方服务机构的数据库中（您已明确知悉在此情况下，您日后的经济活动会受到不良影响）；</p>
      <p
        class="deep-black"
      >（4）根据法律规定，刑事侦查机关为调查犯罪，依法定程序调取的必要个人信息；或行政机关、司法机构，依法定程序并经您授权同意调取的必要个人信息，我们会向其提供您的相关信息；</p>
      <p class="deep-black">非经法定程序或未获得您的同意，我们不会将您的个人信息提供给任何第三方机构或个人。</p>
      <h2>五、信息的安全和保护措施</h2>
      <p>为保障您的信息安全，我们努力采取各种符合业界标准的物理、电子和管理方面的安全措施来保护您的个人信息，防止您的个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如使用加密技术确保数据的保密性；使用受信赖的保护机制防止数据遭到恶意攻击；部署访问控制机制，确保只有授权人员才可访问个人信息；以及举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。</p>
      <p>请注意，单独的设备信息、搜索关键词信息等无法与任何特定个人直接建立联系的数据，不属于个人信息。如果我们将这类非个人信息与其他信息结合用于识别自然人个人身份，或者将其与个人信息结合使用，则在结合使用期间，此类设备信息将被视为个人信息</p>
      <p
        class="deep-black"
      >我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。</p>
      <p
        class="deep-black"
      >互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。</p>
      <p
        class="deep-black"
      >在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。</p>
      <p class="deep-black">在发生派图租赁停止运营或服务时，我们将及时停止继续采集您个人信息的活动，并将停止运营的通知以公告形式通知您，同时对您的个人信息进行匿名化处理。</p>
      <h2>六、风险提示</h2>
      <p class="deep-black">请您注意，任何安全系统都存在可能的及未知的风险。</p>
      <p
        class="deep-black"
      >您知悉：包含您身份信息、财产信息、账户信息、信用信息、交易信息、行踪轨迹信息、电子设备信息、电子设备操作日志等信息为您重要且私密的个人信息。您充分了解并明确知悉派图租赁向第三方采集并在法律法规许可范围向信息使用者提供这些信息后，虽然我们将与可能接触到您的个人信息的我们的合作方及供应商等第三方签署保密协议并尽合理的努力督促其履行保密义务，但我们无法保证第三方一定会按照我们的要求采取保密措施，信息被其他主体对外提供和使用的风险，包括但不限于：该等信息被派图租赁依法提供给第三方后被他人不当利用的风险、第三方向您推销产品或服务而打扰您等风险；我们亦不对第三方的行为及后果承担任何责任。 此情况下，您同意并不可撤销地授权派图租赁依照本隐私条款约定向其他机构提供您的个人信息。</p>
      <p>作为用户，您可根据您的意愿决定是否使用派图租赁平台中的服务，是否主动提供个人信息。同时，您可以查看您提供给我们的个人信息。如果您希望删除或更正您的个人信息，请联系派图租赁的客服人员。</p>
      <h2>七、通知和修订</h2>
      <p>
        为给您提供更好的服务，我们的业务将不时变化，本隐私条款也将随之调整。
        <span
          class="deep-black"
        >我们会通过在我们网站、移动端上发出更新版本或以其他方式提醒您相关内容的更新，也请您访问我们以便及时了解最新的隐私条款。</span>在前述情况下，若您继续使用我们的服务，即表示同意接受修改后的本条款并受之约束。
      </p>
      <p>如果您对于本隐私条款或在使用我们服务时对于您的个人信息或隐私情况有任何问题，请联系我们的客服并作充分描述，我们将尽力解决。</p>
      <p
        class="deep-black"
      >如果您对我们的回复不满意，特别是认为我们的个人信息处理行为损害了您的合法权益，您还可以通过以下外部途径寻求解决方案：个人信息控制者所在管辖区的法院、认证个人信息控制者隐私条款的独立机构、行业自律协会或政府相关管理机构。</p>

      <span slot="footer" class="dialog-footer">
        <!-- <el-button @click="dialogVisible = false">拒 绝</el-button> -->
        <el-button @click="handleClose">拒 绝</el-button>
        <el-button :disabled="hasRead" type="primary" @click="agree">同 意</el-button>
      </span>
    </el-dialog>
  </div>
</template>

<script>
import ipcApi from "@/utils/ipcRenderer";
import { storage } from "@/utils/storage";
import ErrorNotice from "ServeComponents/timeout";
export default {
  data() {
    return {
      dialogVisible: true,
      hasRead: true
    };
  },
  created() {
    try {
      if (this.$db.has("showDialog").value() == 1) {
        this.dialogVisible = false;
      } else {
        this.dialogVisible = true;
      }
    } catch (error) {
      ErrorNotice({
        icon_name: "cuowu1",
        title: "警告：主数据库损毁！",
        message:
          "可能造成的原因：新版本中更新了数据库加密算法导致原数据库信息无法读取，您可以尝试下面的恢复按钮进行恢复，如果恢复失败，那就只能很遗憾的告诉您，数据已经没救辣",
        primaryButton: "尝试恢复"
      });
    }
  },
  mounted() {
    if (this.dialogVisible) {
      this.$nextTick(() => {
        let dom = document.getElementsByClassName("el-dialog__body")[0];
        dom.addEventListener("scroll", this.handleScroll);
      });
    }
  },
  methods: {
    handleClose(done) {
      this.$confirm("确定退出软件使用？")
        .then(_ => {
          this.dialogVisible = false;
          ipcApi.send("window-close");
          done();
        })
        .catch(_ => {});
    },
    handleScroll() {
      let dom = document.getElementsByClassName("el-dialog__body")[0];
      if (dom.scrollTop + dom.clientHeight == dom.scrollHeight) {
        this.hasRead = false;
      }
    },
    agree() {
      this.$db.set("showDialog", 1).write();
      this.dialogVisible = false;
    }
  }
};
</script>

<style lang="scss" scoped>
.wrap {
  color: #000;
  line-height: 30px;
}
/deep/ {
  .el-dialog {
    .el-dialog__body {
      height: 500px;
      overflow: auto;
    }
  }
}
p {
  text-indent: 2em;
  font-size: 16px;
}
h1 {
  margin-bottom: 20px;
  text-align: center;
}
h2 {
  margin-top: 20px;
}
.deep-black {
  font-weight: bold;
}
</style>